<template>
  <div class="flex-1 pb-[100px]">
    <div class="w-full text-[#fff] z-[100] relative">
      <div class="w-full flex gap-8 flex-row select-none">

        <div class="basis-3/4 pt-3">
          <div class="w-full flex flex-col dashboard-card pt-[0.625rem] pb-[0.875rem]">
            <div class="flex items-center gap-[2rem] px-[2rem]">
              <span class="text-white text-[16px]">نمودار روند دارایی</span>
              <UiButtonTabButton class="flex-1" :list="data" v-model="tabIndex"></UiButtonTabButton>
            </div>

            <div class="w-full h-auto flex justify-center items-center mt-[0.5rem]">
              <UiChartAssets v-if="tabIndex == 0" :day="7"></UiChartAssets>
              <UiChartAssets v-if="tabIndex == 1" :day="30"></UiChartAssets>
              <UiChartAssets v-if="tabIndex == 2" :day="90"></UiChartAssets>
            </div>
          </div>
          <div class="pt-4">
            <DashboardAssetDispersion> </DashboardAssetDispersion>
          </div>
          <div class="w-full mt-3 flex flex-col dashboard-card pt-[0.625rem] pb-[0.875rem]">
            <div class="flex items-center gap-[2rem] px-[2rem]">
              <span class="text-white text-[16px]"> نمودار سود و زیان</span>
              <UiButtonTabButton class="flex-1" :list="data" v-model="tabIndex"></UiButtonTabButton>
            </div>

            <div class="w-full h-auto flex justify-center items-center mt-[0.5rem]">
              <UiChartProfitLossChart :day="30"></UiChartProfitLossChart>
            </div>
          </div>

        </div>

        <div class="basis-1/4  ">
          <div class="w-full h-[173px] bg-[#171717] z-10 relative rounded-2xl py-5 px-6">
            <div class="flex items-center gap-3">
              <p class="text-[#676767] text-[16px] font-bold leading-[29px]">موجودی کل :</p>

              <svg xmlns="http://www.w3.org/2000/svg" width="19" height="16" viewBox="0 0 19 16" fill="none">
                <path
                  d="M7.08731 0.405573C8.497 -0.131326 10.0616 -0.138731 11.4709 0.404647C11.7067 0.504621 11.9686 0.576362 12.1475 0.79251C12.3878 1.06883 12.4622 1.51223 12.3252 1.86862C12.1605 2.32499 11.6649 2.60177 11.2538 2.41385C10.173 1.9038 8.93939 1.83854 7.81838 2.2139C6.68965 2.58927 5.68412 3.41869 5.01404 4.51794C4.4082 5.50056 4.08047 6.69793 4.08169 7.89809C4.59727 7.89947 5.11284 7.89623 5.62841 7.89901C5.82643 7.88975 6.01306 8.05406 6.05779 8.27299C6.10008 8.4447 6.04559 8.63262 5.93255 8.75296C5.13276 9.66383 4.33297 10.5752 3.53237 11.4847C3.37339 11.6818 3.07738 11.6897 2.91515 11.4944C2.10682 10.5789 1.30256 9.65874 0.495447 8.74231C0.340124 8.58356 0.314508 8.29567 0.439335 8.10498C0.51659 7.97677 0.649956 7.89855 0.786575 7.89994C1.30662 7.89531 1.82667 7.89994 2.34671 7.89762C2.34631 6.3906 2.73055 4.88497 3.45227 3.62002C4.29801 2.12133 5.60077 0.964225 7.08731 0.405573Z"
                  fill="white" />
                <path
                  d="M15.2386 4.5183C15.3959 4.317 15.696 4.31099 15.8578 4.50858C16.6653 5.4253 17.4719 6.34386 18.2778 7.26289C18.4485 7.43735 18.4542 7.76544 18.2932 7.95007C18.2054 8.06206 18.0708 8.10926 17.9419 8.10417C17.4361 8.10463 16.9303 8.10371 16.4246 8.10464C16.4319 10.2185 15.6525 12.3157 14.3107 13.7784C13.126 15.0931 11.5155 15.896 9.86234 15.989C8.85808 16.051 7.84122 15.8636 6.91056 15.4291C6.55846 15.269 6.3324 14.8243 6.38404 14.3967C6.42673 13.9316 6.79672 13.5452 7.20574 13.5281C7.42122 13.5114 7.61394 13.6382 7.81195 13.7127C8.88817 14.1338 10.0872 14.1292 11.1634 13.71C12.2721 13.2838 13.2418 12.4129 13.8704 11.2898C14.4047 10.3462 14.6889 9.22635 14.6897 8.10417C14.1469 8.09769 13.6037 8.1162 13.0617 8.09538C12.7312 8.05327 12.5811 7.53082 12.8214 7.27168C13.6248 6.35126 14.4327 5.43548 15.2386 4.5183Z"
                  fill="white" />
              </svg>
              <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M11.5851 9.87886C12.6751 9.33477 13.8734 8.99963 15.0865 9C16.3856 9.00258 17.6702 9.38075 18.8188 10.0039C19.5316 10.3692 20.1983 10.8269 20.8304 11.3268C21.9878 12.2531 23.0256 13.3387 23.9246 14.5362C24.0195 14.6576 24.0889 14.8007 24.1101 14.957V15.0335C24.0921 15.195 24.0198 15.3429 23.9222 15.4676C23.105 16.554 22.1753 17.5502 21.1434 18.4158C20.273 19.1534 19.3173 19.7832 18.2928 20.2607C17.3914 20.672 16.4236 20.9391 15.439 20.9909C14.0049 21.0663 12.5711 20.6668 11.3072 19.9726C10.3875 19.4948 9.5435 18.8705 8.75522 18.1855C7.82628 17.3648 6.97772 16.4454 6.23033 15.443C6.1415 15.3271 6.08051 15.1892 6.06006 15.0416V14.9666C6.09355 14.6583 6.32623 14.4416 6.49721 14.208C7.17161 13.3465 7.92323 12.5518 8.73583 11.8323C9.32986 11.3128 9.95562 10.8294 10.624 10.4189C10.93 10.2122 11.2635 10.0562 11.5851 9.87886ZM13.5755 10.4461C12.3987 10.7518 11.3164 11.3677 10.3385 12.1045C9.24772 12.9319 8.27894 13.924 7.4131 15.0001C8.28705 16.0816 9.26252 17.0804 10.3628 17.9096C11.334 18.6402 12.4086 19.2483 13.5755 19.5533C14.5584 19.8273 15.611 19.8273 16.5939 19.554C17.6484 19.2814 18.6281 18.7557 19.5232 18.1215C20.7408 17.2537 21.8097 16.1754 22.7567 15.0001C21.8781 13.9141 20.8988 12.9087 19.79 12.0784C18.817 11.3463 17.7376 10.7423 16.5675 10.4391C15.5924 10.1732 14.5496 10.1746 13.5755 10.4461Z"
                  fill="white" />
                <path
                  d="M14.6075 11.311C15.3824 11.1999 16.1915 11.364 16.8669 11.776C17.4828 12.1457 17.988 12.713 18.2965 13.3811C18.8683 14.5796 18.741 16.0982 17.9785 17.175C17.4856 17.8931 16.74 18.418 15.9158 18.6207C15.2104 18.798 14.4527 18.7436 13.778 18.4644C13.1529 18.2072 12.6005 17.7617 12.2053 17.1948C11.7251 16.5161 11.4791 15.6619 11.5228 14.8195C11.5573 13.9561 11.8993 13.1122 12.4623 12.4794C13.0179 11.8452 13.7907 11.4218 14.6075 11.311ZM14.769 12.5405C14.0805 12.6332 13.4417 13.061 13.0747 13.6761C12.7895 14.1407 12.6636 14.708 12.7197 15.2565C12.7729 15.819 13.0211 16.3572 13.405 16.7552C13.803 17.1728 14.3484 17.4351 14.9121 17.4752C15.399 17.5145 15.8953 17.3891 16.3127 17.1249C16.7414 16.856 17.0841 16.4422 17.2773 15.961C17.5283 15.3459 17.5244 14.6234 17.266 14.0116C17.0615 13.5183 16.6988 13.0993 16.2493 12.8366C15.804 12.5732 15.2763 12.468 14.769 12.5405Z"
                  fill="white" />
              </svg>

            </div>
            <div class="flex items-center justify-between gap-3 pt-4">
              <UiDropDownSimple :list="dashboardStor.currencyList" v-model="dashboardStor.currencyIndex">
              </UiDropDownSimple>
              <p dir="ltr" class="text-[22px]">۴۵۷ ، ۹۶۰ ، ۰۰۰</p>
            </div>

            <div class="flex justify-center items-center gap-3 pt-7">
              <p class="text-[#FF7028] font-bold text-[14px] leading-[26px]">تاریخچه تراکنش‌ها</p>
              <IconsDashboardArrowRightMob></IconsDashboardArrowRightMob>
            </div>

          </div>

          <WalletPortfolioCollaps class="z-[1] relative"></WalletPortfolioCollaps>
        </div>

      </div>
    </div>
  </div>

</template>


<script setup>
const tabIndex = ref(0)
import { useDashboardPageStore } from "~/stores/dashboard-page"
const dashboardStor = useDashboardPageStore();

const data = ref([
  {
    id: 1,
    title: "۷ روزه"
  }, {
    id: 2,
    title: "۳۰ روزه"
  }, {
    id: 3,
    title: "۹۰ روزه"
  }
])

</script>
<style lang="">

</style>