<script setup lang="ts">
const list = [
	{
		title: "قیمت رمز ارز ها را از کجا ببینم ؟",
		content:
			"در صفحه‌ی قیمت لحظه‌ای می‌توانید لیست قیمت رمزارزهای لیست‌شده در نوبیتکس را ببینید. همچنین، در صفحه‌ی بازار هر رمزارز علاوه بر قیمت، می‌توانید به نمودار تغییرات قیمت و سایر نمودارهای مربوط به آن دسترسی داشته باشید و خرید و فروش انجام دهید.",
	},
	{
		title: "چطور شروع کنم و برای شروع معامله چه چیزهایی لازم است ؟",
		content:
			'<p>      برای شروع معاملات رمز ارزها، ابتدا تحقیق کنید و مفاهیم پایه‌ای      ارزهای دیجیتال و بلاکچین را بیاموزید. سپس یک کیف پول دیجیتال را      انتخاب کنید. در یک صرافی معتبر ثبت‌نام و احراز هویت کنید. پس از      واریز پول به حساب صرافی، ارزهای دیجیتال معروفی مانند بیت‌کوین و      اتریوم را خریداری کرده و به کیف پول خود منتقل کنید. مدیریت ریسک را      جدی بگیرید و همیشه مبلغی را سرمایه‌گذاری کنید که می‌توانید از دست      بدهید. پیگیری اخبار و تحلیل‌های بازار مهم است. با مبالغ کم شروع      کنید و به تدریج معاملات خود را گسترش دهید. منابع آموزشی مانند      وبسایت‌های خبری (CoinDesk، CoinTelegraph)، کتاب‌ها (مانند      "Mastering Bitcoin") و دوره‌های آنلاین (Coursera، Udemy) می‌توانند      مفید باشند. با این روش‌ها و یادگیری مداوم، می‌توانید به تدریج به      یک معامله‌گر موفق در بازار ارزهای دیجیتال تبدیل شوید.     </p>'
	},
	{
		title: "کسب درآمد در آرنیتکس چه روش هایی دارد ؟",
		content: '<p> کسب درآمد از طریق دعوت دوستان به صرافی‌های ارز دیجیتال یک راه مؤثر است. پس از ثبت‌نام و دریافت لینک معرفی در آرنیتکس، آن را از طریق شبکه‌های اجتماعی، وبسایت‌ها، وبلاگ‌ها، و پیام‌رسان‌ها به اشتراک بگذارید. هر بار که دوستان شما از طریق لینک شما ثبت‌نام کرده و معامله می‌کنند، شما کمیسیونی از کارمزد معاملات آن‌ها دریافت می‌کنید. برای اطلاعات بیشتر به صفحه دعوت از دوستان مراجعه کنید </p>'
	},
	{
		title: "چگونه بیت‌کوین، تتر و سایر رمزارزها را در آرنیتکس بخرم ؟",
		content: '<p> وارد وبسایت آرنیتکس شوید و یک حساب کاربری ایجاد کنید. فرآیند ثبت‌نام معمولاً شامل ارائه اطلاعات شخصی و تأیید ایمیل است. آرنیتکس هم مانند بسیاری از صرافی‌ها برای افزایش امنیت و رعایت مقررات، نیاز به احراز هویت دارد. این فرآیند معمولاً شامل چند مرحله میباشد. بعد از تأیید هویت، وارد حساب کاربری خود شوید و به بخش واریز بروید. می‌توانید وجه خود را از طریق روش‌های مختلف مانند انتقال بانکی یا شناسه واریزدار واریز کنید. پس از واریز وجه، به بخش خرید/فروش بروید و ارز مورد نظر خود را انتخاب کنید. برای خرید بیت کوین (BTC)، در بخش خرید، بیت کوین را انتخاب کنید. مقدار بیت کوینی که می‌خواهید بخرید یا مبلغی که می‌خواهید هزینه کنید را وارد کنید و سفارش خود را تأیید کنید. برای خرید تتر (USDT)، در بخش خرید، تتر را انتخاب کنید. مقدار تتری که می‌خواهید بخرید یا مبلغی که می‌خواهید هزینه کنید را وارد کنید و سفارش خود را تأیید کنید. با دنبال کردن این مراحل، می‌توانید به راحتی بیت کوین و تتر را در آرنیتکس خریداری کرده و از آن‌ها بهره‌برداری کنید </p>'
	},
]

</script>

<template>
	<!-- <section class="flex flex-col px-[6.25rem] gap-[1.875rem] w-[95rem] mx-auto">
		<h6 class="text-lg text-white font-medium">سوالات متداول</h6>
		<div v-for="item in list" :key="item.title" class="w-full">
			<app-collaps>
				<template #title>
					<h6 class="text-xl text-white font-medium">
						{{ item.title }}
					</h6>
				</template>
				<div v-html="item.content" class="text-base leading-7  text-white font-light py-8"></div>
			</app-collaps>
		</div>
	</section> -->




	<section class="flex flex-col items-center md:items-start px-4 gap-[1.875rem] max-w-[25rem] md:max-w-[95rem] md:px-[6.25rem] mx-auto">
		<h6 class="text-[28px] md:text-xl text-white font-medium">سوالات متداول</h6>
		<div v-for="item in list" :key="item.title" class="w-full">
			<app-collaps>
				<template #title>
					<h6 class="text-[14px] md:text-xl text-white font-medium">
						{{ item.title }}
					</h6>
				</template>
				<div v-html="item.content" class="text-base leading-7  text-white font-light py-8"></div>
			</app-collaps>
		</div>
	</section>


</template>

<style scoped>
.ddd{
	border-top: 1px solid rgba(103, 103, 103, 1)
}
</style>